public/ephemeris/2025-07-06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-orgcfa4150" class="outline-2">
<h2 id="orgcfa4150">2025-07-06 - Writing math proofs</h2>
<div class="outline-text-2" id="text-orgcfa4150">
<p>
Nothing much to tell today. I spent most of my time studying
Algorithms, right now I need to read and summarize the chapters that I
am missing. This is the most energy demanding part but hopefully I
will be done in a week or two. Once I have all my notes, I just need
to get comfortable explaining the details and the proofs, which
usually takess a lot of time but It is less intense.
</p>

<p>
Today I proved the "Master Theorem" for finding the time complexity of
certain types of recursive functions, It took me at least half an hour
to understand the proof but I finally got It and It is nice. I spent
the rest of the day playing the <a href="https://adam.math.hhu.de/">natural number game</a> where you need to
write proof for the properties the basic operations in the natural
numbers (successor, addition, multiplication&#x2026;). It is very
challenging for me since I am quite new to formal proofs and I need to
build an intuition for how these proof assistant work, but at least I
made some progress.
</p>

<p>
Eventually I want to be able to prove some theorems for cryptography
like RSA and some other fundamental theorems from calculus. I know
that Terence Tao has published a calculus book with Lean4 proofs but I
didn't read It yet.
</p>

<p>
Anyway, tomorrow I will start working at the company, which I will
refer to as D from now on. Hopefully It will go as smoothly as the
last few days have (mostly) been.
</p>

<p>
Expenses so far (same as yesterday):
</p>

<pre class="example">
 Expenses                           ||           
------------------------------------++-----------
 expenses:food                      ||    $31.82 
 expenses:food:non-essential        ||     $9.20 
 expenses:household:bathroom        ||     $7.86 
 expenses:household:kitchen         ||     $8.74 
 expenses:household:washing-machine ||     $7.49 
 expenses:legal                     ||    $19.92 
 expenses:non-essential             ||     $4.45 
 expenses:rent                      ||  $1406.00 
 expenses:travel:arrival            ||    $39.47 
 expenses:travel:public-transport   ||    $60.50 
------------------------------------++-----------
                                    ||  $1595.45
</pre>

<p>
I'll watch another episode of Better Call Saul this night.
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
